In [24]:
%reload_ext sql

#Connect the notebook with the database
%sql postgresql://user:password@localhost:5432/postgres

### you are given two tables named supermarket_products and supermarket_transactions. Find the top 3 products that are most frequently bought together (purchased in the same transaction).

In [25]:
%%sql

SELECT * FROM supermarket_products LIMIT 10;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(101, 'Apple', 1.25),
 (102, 'Banana', 0.75),
 (103, 'Orange', 1.5),
 (104, 'Milk', 2.2),
 (105, 'Bread', 1.8),
 (106, 'Eggs', 3.0),
 (107, 'Cheese', 4.5),
 (108, 'Tomato', 1.1),
 (109, 'Potato', 0.9),
 (110, 'Chicken', 5.75)]

In [26]:
%%sql

SELECT * FROM supermarket_transactions LIMIT 10;

 * postgresql://user:***@localhost:5432/postgres
10 rows affected.

[(5, 101, 1, 2, datetime.datetime(2025, 8, 10, 9, 1, 44, 339969)),
 (2, 102, 3, 1, datetime.datetime(2025, 8, 11, 9, 1, 44, 339969)),
 (3, 103, 5, 3, datetime.datetime(2025, 8, 12, 9, 1, 44, 339969)),
 (4, 104, 2, 1, datetime.datetime(2025, 8, 13, 9, 1, 44, 339969)),
 (5, 105, 6, 2, datetime.datetime(2025, 8, 20, 9, 1, 44, 339969)),
 (6, 107, 4, 1, datetime.datetime(2025, 8, 20, 9, 1, 44, 339969)),
 (7, 107, 1, 2, datetime.datetime(2025, 8, 20, 9, 1, 44, 339969)),
 (8, 108, 2, 1, datetime.datetime(2025, 8, 20, 9, 1, 44, 339969)),
 (9, 109, 5, 2, datetime.datetime(2025, 8, 20, 9, 1, 44, 339969)),
 (10, 110, 3, 1, datetime.datetime(2025, 8, 20, 9, 1, 44, 339969))]

In [28]:
%%sql

SELECT
    sp1.product_name AS product_1,
    sp2.product_name AS product_2,
    COUNT(*) AS times_bought_together
FROM supermarket_transactions t1
JOIN supermarket_transactions t2
    ON t1.transaction_id = t2.transaction_id
    AND t1.product_id < t2.product_id
JOIN supermarket_products sp1 ON t1.product_id = sp1.product_id
JOIN supermarket_products sp2 ON t2.product_id = sp2.product_id
GROUP BY sp1.product_name, sp2.product_name
ORDER BY times_bought_together DESC
LIMIT 3;

 * postgresql://user:***@localhost:5432/postgres
3 rows affected.

[('Banana', 'Milk', 4), ('Milk', 'Bread', 3), ('Banana', 'Bread', 2)]